create table install as
select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp7
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp1
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp2
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp3
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp5
union all

select "баллы", "вид_работ", "внешние_номера", "дата_исполнения_факт", "исполнитель", "категория", "категория_клиента", "лицевой_счет", "мрф", "населенный_пункт"::text, "номер_заявки", "номер_нарядазаявки","подразделение", "причина_отказа"::text, "работы", "сегмент", "статус_исполнения_наряда", "технология", "тип_договора", "тип_задания", "тип_застройки", "тип_наряда", "филиал", file
from temp6
